# Wunchana Seubwai

# APPLIED DATABASE TECHNOLOGIES Spring 2023

# Final Project Part 2: Database Design

In [ ]:
# import important python libraries
import sqlalchemy
import mysql.connector
import pandas as pd
import numpy as np
import plotly.express as px
import matplotlib.pyplot as plt
import plotly.graph_objects as go

### Data preparation and cleaning

In [ ]:
# Read a CSV file into DataFrame 
df = pd.read_csv("2023 QS World University Rankings.csv")

In [ ]:
# Print the information about a DataFrame 
df.info()

In [ ]:
#Rename columns in DataFrame
df.rename(columns = 
          {'Rank':'rank', 
           'location code':'location_code', 
           'ar score':'ar_score', 
           'ar rank':'ar_rank', 
           'er score':'er_score',
          'er rank':'er_rank',
          'fsr score':'fsr_score',
          'fsr rank':'fsr_rank',
          'cpf score':'cpf_score',
          'cpf rank':'cpf_rank',
          'ifr score':'ifr_score',
          'ifr rank':'ifr_rank',
          'isr score':'isr_score',
           'isr rank':'isr_rank',
           'irn score':'irn_score',
          'irn rank':'irn_rank',
           'ger score':'ger_score',
           'ger rank':'ger_rank',
           'score scaled':'score_scaled'}, inplace = True)

In [ ]:
# Get a sum of null values from each column
df.isna().sum()

In [ ]:
# Fill all NaN values with the value '0'
df = df.fillna(0)
df = df.replace(np.nan, 0)

In [ ]:
df.isna().sum()

In [ ]:
# Some record has special symbol '+'. So, we need to replace '+' symbol with ' '. 
clean_col = ['ar_score', 'ar_rank', 'er_score', 'er_rank', 'fsr_score', 'fsr_rank', 'cpf_score', 'cpf_rank', 'ifr_score', 'ifr_rank', 'isr_score', 'isr_rank', 'irn_score', 'irn_rank', 'ger_score', 'ger_rank']

for col in clean_col:
    if df[col].dtype == 'object':
        df[col] = df[col].str.replace('+', '').astype(float)

In [ ]:
print(df.dtypes)

In [ ]:
# See the first 5 rows in DataFrame 
df.head(5)

### Establish a connection to the database

In [ ]:
# Connect to MySQL 
db = mysql.connector.connect(host="host name",user="user name",password="password")

In [ ]:
# create a MySQL server connection object
cursor = db.cursor(dictionary=True)

In [ ]:
# Create database namely "world_university_rankings_2023" 
cursor.execute("CREATE DATABASE world_university_rankings_2023")

In [ ]:
# Use the "world_university_rankings_2023" database as the default (current) database for subsequent statements
cursor.execute("USE world_university_rankings_2023")

### Create and Set "PRIMARY KEY" in three tables, including (1) university, (2) ranking, and (3) university_location.

In [ ]:
# Create "university" table
cursor.execute("""CREATE TABLE university (
    institution VARCHAR(255) PRIMARY KEY,
    rank INT NOT NULL,
    location_code VARCHAR(255) NOT NULL)
""")

In [ ]:
# Create "ranking" table
cursor.execute("""CREATE TABLE ranking (
    rank INT PRIMARY KEY,
    ar_score FLOAT NOT NULL,
    ar_rank INT NOT NULL,
    er_score FLOAT NOT NULL,
    er_rank INT NOT NULL,
    fsr_score FLOAT NOT NULL,
    fsr_rank INT NOT NULL,
    cpf_score FLOAT NOT NULL,
    cpf_rank INT NOT NULL,
    ifr_score FLOAT NOT NULL,
    ifr_rank INT NOT NULL,
    isr_score FLOAT NOT NULL,
    isr_rank INT NOT NULL,
    irn_score FLOAT NOT NULL,
    irn_rank INT NOT NULL,
    ger_score FLOAT NOT NULL,
    ger_rank INT NOT NULL)
""")

In [ ]:
# Create "university_location" table
cursor.execute("""CREATE TABLE university_location (
    location_code VARCHAR(255) PRIMARY KEY,
    location VARCHAR(255) NOT NULL)
""")

In [ ]:
# Create "users" table

cursor.execute("""CREATE TABLE users (
    id INT PRIMARY KEY AUTO_INCREMENT,
    username VARCHAR(255) NOT NULL,
    password VARCHAR(255) NOT NULL,
    email VARCHAR(255) NOT NULL)
""")

### Insert data from Dataframe into three tables: (1) university, (2) ranking, and (3) university_location.

In [ ]:
# Creates three new DataFrames 
df_university = df[['institution', 'rank', 'location_code']]
df_ranking = df[['rank', 'ar_score', 'ar_rank', 'er_score', 'er_rank', 'fsr_score', 'fsr_rank', 'cpf_score', 'cpf_rank', 'ifr_score', 'ifr_rank', 'isr_score', 'isr_rank', 'irn_score', 'irn_rank', 'ger_score', 'ger_rank']]
df_university_location = df[['location_code', 'location']]

In [ ]:
# Connect to SQL database using SQLAlchemy 
engine = sqlalchemy.create_engine('mysql+mysqlconnector://username:password@hostname/world_university_rankings_2023', echo = True)

In [ ]:
df_ranking = df_ranking.fillna(0)
df_university_location = df_university_location.fillna(0)
df_university_location = df_university_location.drop_duplicates(subset=['location_code'])

In [ ]:
# Write records stored in a DataFrame to a SQL database.
df_university.to_sql(name='university', con=engine, if_exists='append', index=False)

In [ ]:
df_ranking.to_sql(name='ranking', con=engine, if_exists='append', index=False)

In [ ]:
df_university_location.to_sql(name='university_location', con=engine, if_exists='replace', index=False)

### Display all the tables and databases present in MySQL

In [ ]:
# Display all the databases present in MySQL
db = mysql.connector.connect(host="host name",user="user name",password="password", database = 'world_university_rankings_2023')
cursor = db.cursor(dictionary=True)

cursor.execute("SHOW DATABASES")
databases = cursor.fetchall()
for database in databases:
    print(database)

In [ ]:
# Display all tables inside a 'world_university_rankings_2023' database

cursor.execute("Show tables;")
tables = cursor.fetchall()
for table in tables:
    print(table)

### Create SQL Views

In [ ]:
# Create views namely ‘university_rank_location’ that show common data for university ranking include ‘institution’, ‘rank’, and ‘location’.

query_view = "CREATE VIEW university_rank_location AS SELECT university.institution, university.rank, university_location.location FROM university JOIN university_location ON university.location_code = university_location.location_code"
cursor.execute(query_view)

In [ ]:
# Create views namely ‘university_rank_info’ that show important informations for university ranking 

query_view = "CREATE VIEW university_rank_info AS SELECT university.institution, university.rank, ranking.ar_score, ranking.ar_rank, ranking.er_score, ranking.er_rank, ranking.fsr_score, ranking.fsr_rank, ranking.cpf_score, ranking.cpf_rank, ranking.ifr_score, ranking.ifr_rank, ranking.isr_score, ranking.isr_rank, ranking.irn_score, ranking.irn_rank, ranking.ger_score, ranking.ger_rank FROM university JOIN ranking ON university.rank = ranking.rank"
cursor.execute(query_view)

### Build queries relevant to application functionality design

In [ ]:
# 1. Query to SELECT the top 10 global universities based on QS ranking

query_top10 = "SELECT university.institution, university.rank, university_location.location FROM university JOIN university_location ON university.location_code = university_location.location_code ORDER BY rank ASC LIMIT 10" 

cursor.execute(query_top10)
top10_universities = cursor.fetchall()

for i in top10_universities:
  print(i)

In [ ]:
# 2. Query to SELECT the best university in each country based on QS ranking

query_best_university = """
SELECT university_location.location, university.institution, university.rank
FROM university
JOIN university_location ON university.location_code = university_location.location_code
WHERE university.rank = (
    SELECT MIN(rank) 
    FROM university u 
    WHERE u.location_code = university.location_code)
ORDER BY university_location.location"""

cursor.execute(query_best_university)
best_universities = cursor.fetchall()

for i in best_universities:
    print(i)

In [ ]:
# 3. Query to SELECT the top 10 global university based on Employment Outcomes (ger_score, ger_rank)

query_ger = """SELECT university.institution, university_location.location, ranking.ger_rank, ranking.ger_score
FROM university
JOIN university_location ON university.location_code = university_location.location_code
JOIN ranking ON university.rank = ranking.rank
WHERE ger_rank > 0
ORDER BY ger_rank ASC LIMIT 10
"""
cursor.execute(query_ger)
ger_rank_score = cursor.fetchall()

for i in ger_rank_score:
    print(i)

In [ ]:
# 4. Query to SELECT the top 10 global university based on Employer reputation (er_score, er_rank)

query_er = """SELECT university.institution, university_location.location, ranking.er_rank, ranking.er_score
FROM university
JOIN university_location ON university.location_code = university_location.location_code
JOIN ranking ON university.rank = ranking.rank
WHERE er_rank > 0
ORDER BY er_rank ASC LIMIT 10
"""
cursor.execute(query_er)
er_rank_score = cursor.fetchall()

for i in er_rank_score:
    print(i)

In [ ]:
# 5. Query to SELECT the top 10 global university based on Academic reputation  (ar_score, ar_rank)

query_ar = """SELECT university.institution, university_location.location, ranking.ar_rank, ranking.ar_score
FROM university
JOIN university_location ON university.location_code = university_location.location_code
JOIN ranking ON university.rank = ranking.rank
WHERE ar_rank > 0
ORDER BY ar_rank ASC LIMIT 10
"""
cursor.execute(query_ar)
ar_rank_score = cursor.fetchall()

for i in ar_rank_score:
    print(i)

In [ ]:
# 6. Query to SELECT the top 10 global university based on Citations per faculty (cpf_score, cpf_rank)

query_cpf = """SELECT university.institution, university_location.location, ranking.cpf_rank, ranking.cpf_score
FROM university
JOIN university_location ON university.location_code = university_location.location_code
JOIN ranking ON university.rank = ranking.rank
WHERE cpf_rank > 0
ORDER BY cpf_rank ASC LIMIT 10
"""
cursor.execute(query_cpf)
cpf_rank_score = cursor.fetchall()

for i in cpf_rank_score:
    print(i)

In [ ]:
# 7. Query to SELECT the top 10 global university based on International research network (irn_score, irn_rank)

query_irn = """SELECT university.institution, university_location.location, ranking.irn_rank, ranking.irn_score
FROM university
JOIN university_location ON university.location_code = university_location.location_code
JOIN ranking ON university.rank = ranking.rank
WHERE irn_rank > 0
ORDER BY irn_rank ASC LIMIT 10
"""
cursor.execute(query_irn)
irn_rank_score = cursor.fetchall()

for i in irn_rank_score:
    print(i)

In [ ]:
# 8. Query to INSERT new data of new university into the university and ranking table (Example: name, location and values)

# Query to insert new data from new university into the university table
insert_query1 = "INSERT INTO university (institution, rank, location_code) VALUES (%s, %s, %s)"
val1 = ('New University', '1423', 'US')
cursor.execute(insert_query1, val1)

# Query to insert new data from new university into the ranking table
insert_query2 = "INSERT INTO ranking (rank, ar_score, ar_rank, er_score, er_rank, fsr_score, fsr_rank, cpf_score, cpf_rank, ifr_score, ifr_rank, isr_score, isr_rank, irn_score, irn_rank, ger_score, ger_rank) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"
val2 = ('1423', '0', '1423', '0', '1423', '0', '1423', '0', '1423', '0', '1423', '0', '1423', '0', '1423', '0', '1423')
cursor.execute(insert_query2, val2)

db.commit()

In [ ]:
# 9. Query to UPDATE data into 'New University' on ranking table.

update_query = "UPDATE ranking SET ar_score = '1', ar_rank = '1423', er_score = '1', er_rank = '1423', fsr_score = '1', fsr_rank = '1423', cpf_score = '1', cpf_rank = '1423', ifr_score = '1', ifr_rank = '1423', isr_score = '1', isr_rank = '1423', irn_score = '1', irn_rank = '1423', ger_score = '1', ger_rank = '1423' WHERE rank = '1423'"
cursor.execute(update_query)

db.commit()

In [ ]:
# 10. Query to DELETE new data of 'New University'on university and ranking table. 

cursor.execute("DELETE FROM university WHERE institution = 'New University'")
cursor.execute("DELETE FROM ranking WHERE rank = 1423")

db.commit()

In [ ]:
# 11. Query to PLOT Radar chart of 'institution' using er_score, er_score, fsr_score, cpf_score, ifr_score,isr_score, irn_score, ger_score from ranking table

query_radar_chart = """SELECT university.institution, ranking.er_score, ranking.fsr_score, ranking.cpf_score, ranking.ifr_score, ranking.isr_score, ranking.irn_score, ranking.ger_score
    FROM ranking
    JOIN university ON ranking.rank = university.rank
    WHERE university.institution = 'Harvard University'
"""
cursor.execute(query_radar_chart)
radar_chart = cursor.fetchall()
df = pd.DataFrame(radar_chart, columns=['institution', 'er_score', 'fsr_score', 'cpf_score', 'ifr_score', 'isr_score', 'irn_score', 'ger_score'])

fig = go.Figure()
fig.add_trace(go.Scatterpolar(r=[df['er_score'][0], df['fsr_score'][0], df['cpf_score'][0], df['ifr_score'][0], df['isr_score'][0], df['irn_score'][0], df['ger_score'][0], df['er_score'][0]],
      theta=['ER score', 'FSR score', 'CPF score', 'IFR score', 'ISR score', 'IRN score', 'GER score', 'ER score'],
      fill='toself'))

fig.update_layout(
    polar=dict(radialaxis=dict(visible=True, range=[0, 100])),
    showlegend=False,
    title={'text': 'Harvard University QS ranking scores',
        'x': 0.5,
        'y': 0.90,
        'xanchor': 'center',
        'yanchor': 'top'})
    
fig.show()